_sdaiCreateComplexInstanceBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Creates a complex instance with specified name within a model.
\param model        [in] A model to create the complex instance within.
\param complexName  [in] A name of complex entity like "name1+name2", where name1, name2 is a name of entity for combination to complex.
\returns A created complex entity.
\remarks
The functions starting from _sdai are ODA extensions over the standard.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiMO_NVLD - SDAI-model invalid.
* sdaiED_NDEF - Entity definition is not defined.
* sdaiEI_NEXS - Entity instance does not exist.
\code
SdaiEntity complexInstance = _sdaiCreateComplexInstanceBN(model, "odanamedunit+odasiunit");